In [3]:
import pandas as pd # data frame operations
import numpy as np   #math operations
import matplotlib.pyplot as plt   #Diagrams /plots
import seaborn as sns    #Diagrams/plots

In [4]:
path=r"C:\Users\HP\data files\bank.csv"
pd.read_csv(path,sep=';')

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4516,33,services,married,secondary,no,-333,yes,no,cellular,30,jul,329,5,-1,0,unknown,no
4517,57,self-employed,married,tertiary,yes,-3313,yes,yes,unknown,9,may,153,1,-1,0,unknown,no
4518,57,technician,married,secondary,no,295,no,no,cellular,19,aug,151,11,-1,0,unknown,no
4519,28,blue-collar,married,secondary,no,1137,no,no,cellular,6,feb,129,4,211,3,other,no
4520,44,entrepreneur,single,tertiary,no,1136,yes,yes,cellular,3,apr,345,2,249,7,other,no

# create dataframe using list

In [5]:
name=["ramesh","suresh","sathish"]
age=[30,35,40]
name,age

(['ramesh', 'suresh', 'sathish'], [30, 35, 40])

In [6]:
pd.DataFrame() #make the data frame

Empty DataFrame
Columns: []
Index: []

# Provide data

step2

In [7]:
pd.DataFrame(zip(name,age))

         0   1
0   ramesh  30
1   suresh  35
2  sathish  40

# provide columns
step 3

In [8]:
#provide columns
data=zip(name,age)
cols=['Name','Age']
#pd.DataFrame(data,columns=['name','age'])
pd.DataFrame(data,columns=cols)

      Name  Age
0   ramesh   30
1   suresh   35
2  sathish   40

# provide index
step 4

In [9]:
data=zip(name,age)
cols=['Name','age']
ind=['A','B','C']
pd.DataFrame(data,columns=cols,index=ind)

      Name  age
A   ramesh   30
B   suresh   35
C  sathish   40

***step 5***

In [17]:
name=['ramesh',"suresh","satish"]
age=[30,35,40]
df=pd.DataFrame(zip(name,age),
               columns=["name","age"],
               index=["A","B","C"])
df

     name  age
A  ramesh   30
B  suresh   35
C  satish   40

* if u want add a new colum
* df["new column']
* you need to have a list which is having some elements
* that elements need to equal to number of rows
* city_names=["hyd","blr","chennai"]
* df["city"]=city_names

In [18]:

df['city']=['Hyd','Blr','chennai']
df

     name  age     city
A  ramesh   30      Hyd
B  suresh   35      Blr
C  satish   40  chennai

In [19]:
city_names=['Hyd','Blr','chennai']
df['city']=city_names
df

     name  age     city
A  ramesh   30      Hyd
B  suresh   35      Blr
C  satish   40  chennai

#step-6
update the existing column
* if u want to create new column or update the old colum
* both are same way

In [21]:
df['name']=["swamy","asif","sathwik"]
df

      name  age     city     Name
A    swamy   30      Hyd    swamy
B     asif   35      Blr     asif
C  sathwik   40  chennai  sathwik

In [23]:
df.drop("Name", #column name
        axis=1, #column
        inplace=True) #overwrite the same

KeyError: "['Name'] not found in axis"

In [24]:
df

      name  age     city
A    swamy   30      Hyd
B     asif   35      Blr
C  sathwik   40  chennai

In [25]:
df.drop("city", #column name
        axis=1, #column
        inplace=True) #overwrite the same

In [26]:
name=['ramesh',"suresh","satish"]
age=[30,35,40]
df=pd.DataFrame(zip(name,age),
               columns=["name","age"],
               index=["A","B","C"])
city_names=["hyd","blr","chennai"]
df["city"]=city_names
df.drop("city",
       axis=1,
       inplace=True)
df

     name  age
A  ramesh   30
B  suresh   35
C  satish   40

In [21]:
"""step-7
drop the colum
-inorder to drop the column
-we need to use drop method
-It takes 3 parameters
  - drop column or row
  - mention the column name
  -axis
-axis=1 reference as column
-axis=0 reference as row
-you want to create a new data frame or
-you want to overwrite the existing data frame
= inplace=true

"""

'step-7\ndrop the colum\n-inorder to drop the column\n-we need to use drop method\n-It takes 3 parameters\n  - drop column or row\n  - mention the column name\n  -axis\n-axis=1 reference as column\n-axis=0 reference as row\n-you want to create a new data frame or\n-you want to overwrite the existing data frame\n= inplace=true\n\n'

In [27]:
#drop the row 
df.drop("c",
       axis=0,
       inplace=True)
df

KeyError: "['c'] not found in axis"

# step -9
# save the data frame

In [26]:
df.to_csv("output.csv")
#while saving
df.to_excel("output.xlsx")

In [27]:
#read output csv
pd.read_csv("output.csv")

  Unnamed: 0    name  age
0          A  ramesh   30
1          B  suresh   35
2          C  satish   40

# Remove the index

In [28]:
#to avoid the above problem
#give index=false
df.to_csv("output.csv",index=False)

In [29]:
#read ouput csv
pd.read_csv("output.csv")

     name  age
0  ramesh   30
1  suresh   35
2  satish   40

# Create dataframes using dictionary

In [30]:
d1={"name":['ramesh','suresh','sathish'],"AGE":[30,35,40]}
pd.DataFrame(d1)
#no need of zip
#no need of column names

      name  AGE
0   ramesh   30
1   suresh   35
2  sathish   40

In [40]:
df

     name  age
A  ramesh   30
B  suresh   35
C  satish   40